In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("domestic_visitors_2016.csv")
df1 = pd.read_csv("domestic_visitors_2017.csv")
df2 = pd.read_csv("domestic_visitors_2018.csv")
df3 = pd.read_csv("domestic_visitors_2019.csv")

In [3]:
def head(n):
    return n.head()

def shape(n):
    return n.shape

def null(n):
    return n.isnull().sum()

def dupli(n):
    return n.duplicated().sum()

def drpna(n):
    n.dropna(inplace=True)

In [4]:
print("2016 \n", head(df))
print("2017 \n", head(df1))
print("2018 \n", head(df2))
print("2019 \n", head(df3))

2016
    district        date     month  year visitors
0  Adilabad  01-01-2016   January  2016   792136
1  Adilabad  01-02-2016  February  2016   937820
2  Adilabad  01-03-2016     March  2016   582946
3  Adilabad  01-04-2016     April  2016   341948
4  Adilabad  01-05-2016       May  2016   252887
2017
    district        date     month  year visitors
0  Adilabad  01-01-2017   January  2017   318799
1  Adilabad  01-02-2017  February  2017    83316
2  Adilabad  01-03-2017     March  2017    27508
3  Adilabad  01-04-2017     April  2017    13946
4  Adilabad  01-05-2017       May  2017    11752
2018
    district        date     month  year visitors
0  Adilabad  01-01-2018   January  2018   320356
1  Adilabad  01-02-2018  February  2018    36550
2  Adilabad  01-03-2018     March  2018    23011
3  Adilabad  01-04-2018     April  2018    14183
4  Adilabad  01-05-2018       May  2018     8197
2019
    district        date     month  year visitors
0  Adilabad  01-01-2019   January  2019    25071
1  Adilabad  01-02-2019  February  2019   406177
2  Adilabad  01-03-2019     March  2019    14347
3  Adilabad  01-04-2019     April  2019     9972
4  Adilabad  01-05-2019       May  2019     6997

In [5]:
print("2016 \n", shape(df))
print("2017 \n", shape(df1))
print("2018 \n", shape(df2))
print("2019 \n", shape(df3))

2016
 (372, 5)
2017
 (372, 5)
2018
 (372, 5)
2019
 (396, 5)

In [6]:
print("2016 \n", null(df))
print("2017 \n", null(df1))
print("2018 \n", null(df2))
print("2019 \n", null(df3))

2016
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64
2017
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64
2018
 district     0
date         0
month        0
year         0
visitors    12
dtype: int64
2019
 district     0
date         0
month        0
year         0
visitors    18
dtype: int64

In [7]:
print("2016 \n", dupli(df))
print("2017 \n", dupli(df1))
print("2018 \n", dupli(df2))
print("2019 \n", dupli(df3))

2016
 0
2017
 0
2018
 0
2019
 0

In [8]:
print("2018 \n", drpna(df2))
print("2019 \n", drpna(df3))

2018
 None
2019
 None

In [9]:
print("2018 \n", null(df2))
print("2019 \n", null(df3))

2018
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64
2019
 district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [23]:
df['date'] = pd.to_datetime(df['date'])
df1['date'] = pd.to_datetime(df1['date'])
df2['date'] = pd.to_datetime(df2['date'])
df3['date'] = pd.to_datetime(df3['date'])

In [36]:
df['year'] = df['year'].astype('int32')
df1['year'] = df1['year'].astype('int32')
df2['year'] = df2['year'].astype('int32')
df3['year'] = df3['year'].astype('int32')

In [51]:
Domestic_Visitors = pd.concat([df,df1, df2,df3], axis=0)

In [52]:
shape(Domestic_Visitors)

(1482, 5)

In [53]:
null(Domestic_Visitors)

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [54]:
dupli(Domestic_Visitors)

0

In [55]:
head(Domestic_Visitors)

   district       date     month  year visitors
0  Adilabad 2016-01-01   January  2016   792136
1  Adilabad 2016-01-02  February  2016   937820
2  Adilabad 2016-01-03     March  2016   582946
3  Adilabad 2016-01-04     April  2016   341948
4  Adilabad 2016-01-05       May  2016   252887

In [56]:
Domestic_Visitors.tail()

            district       date      month  year visitors
391  Yadadri Bhongir 2019-01-08     August  2019   389010
392  Yadadri Bhongir 2019-01-09  September  2019   366862
393  Yadadri Bhongir 2019-01-10    October  2019   381860
394  Yadadri Bhongir 2019-01-11   November  2019   365990
395  Yadadri Bhongir 2019-01-12   December  2019   477635

In [57]:
Domestic_Visitors.head()

   district       date     month  year visitors
0  Adilabad 2016-01-01   January  2016   792136
1  Adilabad 2016-01-02  February  2016   937820
2  Adilabad 2016-01-03     March  2016   582946
3  Adilabad 2016-01-04     April  2016   341948
4  Adilabad 2016-01-05       May  2016   252887

In [58]:
Domestic_Visitors.sample(10)

                     district       date     month  year visitors
319                  Siddipet 2019-01-08    August  2019   190750
270               Ranga Reddy 2016-01-07      July  2016
253         Rajanna Sircilla  2018-01-02  February  2018  1021787
100               Karimnagar  2016-01-05       May  2016  1095642
55                   Jangaon  2016-01-08    August  2016
64   Jayashankar Bhoopalpally 2016-01-05       May  2016
300                  Suryapet 2017-01-01   January  2017        0
15      Bhadradri Kothagudem  2018-01-04     April  2018   341258
275                Peddapalli 2019-01-12  December  2019     2315
359          Warangal (Urban) 2018-01-12  December  2018   180643

In [59]:
Domestic_Visitors.shape

(1482, 5)

In [60]:
Domestic_Visitors.isnull().sum()

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [61]:
Domestic_Visitors.tail()

            district       date      month  year visitors
391  Yadadri Bhongir 2019-01-08     August  2019   389010
392  Yadadri Bhongir 2019-01-09  September  2019   366862
393  Yadadri Bhongir 2019-01-10    October  2019   381860
394  Yadadri Bhongir 2019-01-11   November  2019   365990
395  Yadadri Bhongir 2019-01-12   December  2019   477635

In [76]:
# Domestic_Visitors['visitors'] = Domestic_Visitors['visitors'].astype('int32')

# Replace missing and infinite values with 0
# Domestic_Visitors['visitors'].replace([np.inf, -np.inf], np.nan, inplace=True)
# Domestic_Visitors['visitors'].fillna(0, inplace=True)

# # Cast the column to an integer data type
# Domestic_Visitors['visitors'] = Domestic_Visitors['visitors'].astype('int32')



# Domestic_Visitors['visitors'].replace([np.inf, -np.inf], np.nan, inplace=True)
# Domestic_Visitors['visitors'].fillna(0, inplace=True)
# Domestic_Visitors['visitors'] = Domestic_Visitors['visitors'].astype('int32')


# # Replace blank or empty strings with NaN values
# Domestic_Visitors['visitors'].replace('', np.nan, inplace=True)

# # Fill NaN values with 0
# Domestic_Visitors['visitors'].fillna(0, inplace=True)

# # Cast the column to an integer data type
# Domestic_Visitors['visitors'] = Domestic_Visitors['visitors'].astype('int32')



# Replace missing and non-numeric values with 0
Domestic_Visitors['visitors'] = pd.to_numeric(Domestic_Visitors['visitors'], errors='coerce')
Domestic_Visitors['visitors'].fillna(0, inplace=True)

# Cast the column to an integer data type
Domestic_Visitors['visitors'] = Domestic_Visitors['visitors'].astype('int32')

In [77]:
Domestic_Visitors.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1482 entries, 0 to 395
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   district  1482 non-null   object
 1   date      1482 non-null   datetime64[ns]
 2   month     1482 non-null   object
 3   year      1482 non-null   int32
 4   visitors  1482 non-null   int32
dtypes: datetime64[ns](1), int32(2), object(2)
memory usage: 57.9+ KB

In [79]:
Domestic_Visitors.head()

   district       date     month  year  visitors
0  Adilabad 2016-01-01   January  2016    792136
1  Adilabad 2016-01-02  February  2016    937820
2  Adilabad 2016-01-03     March  2016    582946
3  Adilabad 2016-01-04     April  2016    341948
4  Adilabad 2016-01-05       May  2016    252887

In [80]:
Domestic_Visitors.to_csv("Domestic_Visitors.csv",index=False)

In [81]:
data = pd.read_csv("Domestic_Visitors.csv")
data.head()

   district        date     month  year  visitors
0  Adilabad  2016-01-01   January  2016    792136
1  Adilabad  2016-01-02  February  2016    937820
2  Adilabad  2016-01-03     March  2016    582946
3  Adilabad  2016-01-04     April  2016    341948
4  Adilabad  2016-01-05       May  2016    252887

In [89]:
data.shape

(1482, 5)

In [82]:
data.isnull().sum()

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [83]:
# data.visitors = data.visitors.str.replace('','0')

In [84]:
# data.visitors = data.visitors.str.replace('0','')

In [85]:
data.isnull().sum()

district    0
date        0
month       0
year        0
visitors    0
dtype: int64

In [86]:
data.sample(10)

               district        date     month  year  visitors
276         Sangareddy   2016-01-01   January  2016         0
1263         Mancherial  2019-01-04     April  2019     23026
996   Rajanna Sircilla   2018-01-01   January  2018   2238074
677            Suryapet  2017-01-06      June  2017         0
901          Mancherial  2018-01-02  February  2018     38599
525         Mahbubnagar  2017-01-10   October  2017    196103
1457   Warangal (Rural)  2019-01-12  December  2019     32050
634   Rajanna Sircilla   2017-01-11  November  2017   1191129
733     Yadadri Bhongir  2017-01-02  February  2017    540500
1072   Warangal (Rural)  2018-01-05       May  2018     22100

In [87]:
# data.visitors = data.visitors.fillna(0)
data.fillna(0, inplace=True)

In [88]:
data.sample(10)

                    district        date      month  year  visitors
897              Mahbubnagar  2018-01-10    October  2018    193152
902               Mancherial  2018-01-03      March  2018     20749
648              Sangareddy   2017-01-01    January  2017    195000
1288                Medchal   2019-01-05        May  2019         0
660                 Siddipet  2017-01-01    January  2017     80500
768                Hyderabad  2018-01-01    January  2018   1978396
224                   Nirmal  2016-01-09  September  2016         0
882             Mahabubabad   2018-01-07       July  2018     13970
309                 Suryapet  2016-01-10    October  2016         0
122   Komaram Bheem Asifabad  2016-01-03      March  2016         0